#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fojiglobal/prod-us-east-2-infrastructure/runs/run-YpjAZMEqCFzE2wNd

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
data.aws_acm_certificate.fojilabs_ssl_cert: Refreshing...
module.asg.data.aws_partition.current: Refreshing...
data.aws_iam_instance_profile.base_role: Refreshing...
data.aws_route53_zone.fojilabs_zone: Refreshing...
data.aws_ami.ubuntu_20: Refreshing...
module.asg.data.aws_default_tags.current: Refreshing...
data.aws_availability_zones.available: Refreshing...
module.asg.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.asg.data.aws_default_tags.current: Refresh complete after 0s [id=aws]
data.aws_iam_instance_profile.base_role: Refresh complete after 0s [id=AIPAQ7Z5IDDMIJMLQJB62]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-2]
data.aws_ami.ubuntu_20: Refresh complete after 0s [id=ami-07b36ea9852e986ad]
data.aws_acm_certificate.fojilabs_ssl_cert: Refresh complete after 0s [id=arn:aws:acm:us-east-2:068311062744:certificate/a530068a-7576-473e-b661-35885fd8802b]
data.aws_route53_zone.fojilabs_zone: Refresh complete after 0s [id=Z0615064JM69R55ZC6UO]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.prod will be created
  + resource "aws_route53_record" "prod" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "prod.fojilabs.com"
      + type            = "A"
      + zone_id         = "Z0615064JM69R55ZC6UO"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.www_prod will be created
  + resource "aws_route53_record" "www_prod" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.prod.fojilabs.com"
      + type            = "A"
      + zone_id         = "Z0615064JM69R55ZC6UO"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = true
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = "ipv4"
      + load_balancer_type                          = "application"
      + name                                        = "prod-lb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags                                        = {
          + "Environment"  = "prod"
          + "Name"         = "prod-lb"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                    = {
          + "Environment"  = "prod"
          + "Name"         = "prod-lb"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-2:068311062744:certificate/a530068a-7576-473e-b661-35885fd8802b"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_listener_rule.https_listener_rule[0] will be created
  + resource "aws_lb_listener_rule" "https_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "prod.fojilabs.com",
                  + "www.prod.fojilabs.com",
                ]
            }
        }
    }

  # module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = "false"
      + name                               = "prod-80-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment"  = "prod"
          + "Name"         = "prod-80-tg"
          + "Provisionner" = "Terraform"
        }
      + tags_all                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-80-tg"
          + "Provisionner" = "Terraform"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 10
          + matcher             = "200-399"
          + path                = "/health.html"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.asg.aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + default_instance_warmup          = 300
      + desired_capacity                 = 3
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = "prod-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "0"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "prod"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "prod-web-server"
        }
      + tag {
          + key                 = "Provisionner"
          + propagate_at_launch = true
          + value               = "Terraform"
        }

      + timeouts {}
    }

  # module.asg.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Prod launch template"
      + id                     = (known after apply)
      + image_id               = "ami-07b36ea9852e986ad"
      + instance_type          = "t2.micro"
      + key_name               = "main-us-east-2"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "prod-lt-"
      + tags                   = {
          + "Environment"  = "prod"
          + "Name"         = "prod-lt"
          + "Provisionner" = "Terraform"
        }
      + tags_all               = {
          + "Environment"  = "prod"
          + "Name"         = "prod-lt"
          + "Provisionner" = "Terraform"
        }
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKCiNVbmluc3RhbGwgVW5vZmZpY2lhbCB2ZXJzaW9ucyAKCmZvciBwa2cgaW4gZG9ja2VyLmlvIGRvY2tlci1kb2MgZG9ja2VyLWNvbXBvc2UgZG9ja2VyLWNvbXBvc2UtdjIgcG9kbWFuLWRvY2tlciBjb250YWluZXJkIHJ1bmM7IGRvIHN1ZG8gYXB0IHJlbW92ZSAkcGtnIC15OyBkb25lCgojIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjICBTZXQgdXAgRG9ja2VyJ3MgQXB0IHJlcG9zaXRvcnkuICMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIwojIEFkZCBEb2NrZXIncyBvZmZpY2lhbCBHUEcga2V5OgpzdWRvIGFwdC1nZXQgdXBkYXRlIC15CnN1ZG8gYXB0LWdldCBpbnN0YWxsIGNhLWNlcnRpZmljYXRlcyBjdXJsIGdudXBnIC15CnN1ZG8gaW5zdGFsbCAtbSAwNzU1IC1kIC9ldGMvYXB0L2tleXJpbmdzCmN1cmwgLWZzU0wgaHR0cHM6Ly9kb3dubG9hZC5kb2NrZXIuY29tL2xpbnV4L3VidW50dS9ncGcgfCBzdWRvIGdwZyAtLWRlYXJtb3IgLW8gL2V0Yy9hcHQva2V5cmluZ3MvZG9ja2VyLmdwZwpzdWRvIGNobW9kIGErciAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnIAoKIyBBZGQgdGhlIHJlcG9zaXRvcnkgdG8gQXB0IHNvdXJjZXM6CmVjaG8gXAogICJkZWIgW2FyY2g9IiQoZHBrZyAtLXByaW50LWFyY2hpdGVjdHVyZSkiIHNpZ25lZC1ieT0vZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnXSBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1IFwKICAiJCguIC9ldGMvb3MtcmVsZWFzZSAmJiBlY2hvICIkVkVSU0lPTl9DT0RFTkFNRSIpIiBzdGFibGUiIHwgXAogIHN1ZG8gdGVlIC9ldGMvYXB0L3NvdXJjZXMubGlzdC5kL2RvY2tlci5saXN0ID4gL2Rldi9udWxsCnN1ZG8gYXB0LWdldCB1cGRhdGUgLXkKCgojaW5zdGFsbCB0aGUgRG9ja2VyIHBhY2thZ2VzLiAKCnN1ZG8gYXB0LWdldCBpbnN0YWxsIGRvY2tlci1jZSBkb2NrZXItY2UtY2xpIGNvbnRhaW5lcmQuaW8gZG9ja2VyLWJ1aWxkeC1wbHVnaW4gZG9ja2VyLWNvbXBvc2UtcGx1Z2luIC15CgoKIyBTdGFydCBhbmQgRW5hYmxlIERvY2tlciAKc3VkbyBzZXJ2aWNlIGRvY2tlciBzdGFydApzdWRvIHNlcnZpY2UgZG9ja2VyIGVuYWJsZQoKI0FkZCB1c2VyIGN5YmVyIHRvIGRvY2tlciBncm91cCBhbmQgVXBkYXRlIERvY2tlciBQZXJtaXNzaW9uIApzdWRvIHVzZXJtb2QgLWEgLUcgZG9ja2VyIGN5YmVyCnN1ZG8gY2htb2QgNjY2IC92YXIvcnVuL2RvY2tlci5zb2NrCgojIFJ1biBPV0FTUCBKdWljZSBTaG9wIENvbnRhaW5lcgoKZG9ja2VyIHB1bGwgYmtpbW1pbmljaC9qdWljZS1zaG9wCmRvY2tlciBydW4gLWQgLXAgODA6MzAwMCBia2ltbWluaWNoL2p1aWNlLXNob3A="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = "arn:aws:iam::068311062744:instance-profile/base-ec2-role"
        }

      + maintenance_options {
          + auto_recovery = "default"
        }

      + monitoring {
          + enabled = true
        }
    }

  # module.bastion_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Allow SSH traffic from Public"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "bastion-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"         = "prod"
          + "Name"        = "prod-bastion-sg"
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Env"         = "prod"
          + "Name"        = "prod-bastion-sg"
          + "Provisioner" = "Terraform"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.bastion_sg.aws_security_group_rule.egress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "egress_with_source_security_group_id" {
      + description              = "Allows SSH traffic to Private Subnet"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # module.bastion_sg.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows SSH traffic from Everywhere IPV4"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.bastion_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "Allows SSH traffic from Everywhere IPV6"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.private_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and HTTPS from Public"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "private-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"         = "prod"
          + "Name"        = "prod-private-sg"
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Env"         = "prod"
          + "Name"        = "prod-private-sg"
          + "Provisioner" = "Terraform"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.private_sg.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows All traffic to anywhere IPV4"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.private_sg.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
      + description              = "Allows All traffic to anywhere IPV6"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.private_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Allows HTTP from Public SG"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.private_sg.aws_security_group_rule.ingress_with_source_security_group_id[1] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Allows HTTPS from Public SG"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.private_sg.aws_security_group_rule.ingress_with_source_security_group_id[2] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Allows SSH from Private SG"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Allows HTTP and HTTPS from Public"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "public-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Env"         = "prod"
          + "Name"        = "prod-public-sg"
          + "Provisioner" = "Terraform"
        }
      + tags_all               = {
          + "Env"         = "prod"
          + "Name"        = "prod-public-sg"
          + "Provisioner" = "Terraform"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.public_sg.aws_security_group_rule.egress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "egress_with_source_security_group_id" {
      + description              = "Allows HTTP traffic to Private Subnet"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.public_sg.aws_security_group_rule.egress_with_source_security_group_id[1] will be created
  + resource "aws_security_group_rule" "egress_with_source_security_group_id" {
      + description              = "Allows HTTPS traffic to Private Subnet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTP from Everywhere IPV4"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows HTTPS from Everywhere IPV4"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "Allows HTTP from Everywhere IPV6"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.public_sg.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      + description              = "Allows HTTPS from Everywhere IPV6"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment"  = "prod"
          + "Name"         = "prod-eip"
          + "Provisionner" = "Terraform"
        }
      + tags_all             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-eip"
          + "Provisionner" = "Terraform"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment"  = "prod"
          + "Name"         = "prod-igw"
          + "Provisionner" = "Terraform"
        }
      + tags_all = {
          + "Environment"  = "prod"
          + "Name"         = "prod-igw"
          + "Provisionner" = "Terraform"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment"  = "prod"
          + "Name"         = "prod-ngw"
          + "Provisionner" = "Terraform"
        }
      + tags_all                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-ngw"
          + "Provisionner" = "Terraform"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-rt"
          + "Provisionner" = "Terraform"
        }
      + tags_all         = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-rt"
          + "Provisionner" = "Terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-rt"
          + "Provisionner" = "Terraform"
        }
      + tags_all         = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-rt"
          + "Provisionner" = "Terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-private-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.70.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + tags_all                                       = {
          + "Environment"  = "prod"
          + "Name"         = "prod-public-subnet"
          + "Provisionner" = "Terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.70.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment"  = "prod"
          + "Name"         = "prod-vpc"
          + "Provisionner" = "Terraform"
        }
      + tags_all                             = {
          + "Environment"  = "prod"
          + "Name"         = "prod-vpc"
          + "Provisionner" = "Terraform"
        }
    }

Plan: 46 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @nkempuclovis, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*